use questioning;
go
insert into Ranks ([Text]) values 
	('Початківець'),	
	('Твердий початківець'),	
	('Компетентний'),
	('Досвідчений'),	
	('Експерт');
go
insert into Questions ([Text], [RankId]) values
	('Переживаєте за успіх в роботі?', 1),
	('Прагнете досягти результату швидко?', 1),
	('Легко потрапляєте в тупик при проблемах у роботі?', 1),
	('Чи потрібен чіткий алгоритм для вирішення задач?', 1),
	('Чи використовуєте власний досвід при вирішенні задач?', 2),
	('Чи користуєтесь фіксованими правилами для вирішення задач?', 2),
	('Чи відчуваєте ви загальний контекст вирішення задачі?', 2),
	('Чи можете ви побудувати модель вирішуваної задачі?', 3),
	('Чи вистачає вам ініціативи при вирішенні задач?', 3),
	('Чи можете вирішувати проблеми, з якими ще не стикались?', 3),
	('Чи необхідний вам весь контекст задачі?', 4),
	('Чи переглядаєте ви свої наміри до вирішення задачі?', 4),
	('Чи здатні  ви  навчатись у інших?', 4),
	('Чи обираєте ви нові методи своєї роботи?', 5),
	('Чи допомагає власна інтуїція при вирішенні задач?', 5),
	('Чи застовуєте рішення задач за аналогією?', 5);
go
insert into Answers ([Text], [Mark]) values
--Початківець--
	('Сильно.', 5),	
	('Не дуже.', 3),	
	('Cпокійний.', 2),
	('Дуже.', 5),	
	('Якомога швидше.', 3),	
	('Поступово.', 2),
	('Неодмінно.', 5),	
	('Поступово.', 3),	
	('Зрідка.', 2),
	('Так.', 5),	
	('В окремих випадках.', 3),	
	('Не потрібен.', 2),
--Твердий початківець--
	('Зрідка.', 5),	
	('Частково.', 3),	
	('Ні.', 2),
	('Не потрібні.', 5),	
	--('В окремих випадках.', 3),	already added
	('Так.', 2),
	('В окремих випадках.', 5),	
	--('Частково.', 3),				already added
	--('Так.', 2),					already added
--Компетентний--
	--('Так.', 5),					already added
	('Не повністю.', 3),	
	('В окремих випадках.', 2),
	--('Так.', 5),					already added
	('Зрідка.', 3),
	('Потрібне натхнення.', 2),
	('Ні.', 5),	
	--('В окремих випадках.', 3),	already added
	--('Так.', 2),					already added
--Досвідчений--
	--('Так.', 5),	
	('В окремих деталях.', 3),	
	('В загальному.', 2),
	--('Так.', 5),					already added
	--('Зрідка.', 3),				already added
	('Коли є потреба.', 2),
	--('Так.', 5),					already added
	--('Зрідка.', 3),				already added
	('Коли є потреба.', 2),
--Експерт--
	--('Так.', 5),					already added
	('Вибірково.', 3),	
	('Вистачає досвіду.', 2),
	--('Так.', 5),					already added
	--('Частково.', 3),				already added
	('При емоційному напруженні.', 2),
	('Часто.', 5),	
	--('Зрідка.', 3),				already added
	('Тільки власний варіант.', 2);
go
insert into AnswerVariants ([QuestionId], [AnswerId]) values
--Початківець--
	(1, 1),
	(1, 2),
	(1, 3),
	(2, 4),
	(2, 5),
	(2, 6),
	(3, 7),
	(3, 8),
	(3, 9),
	(4, 10),
	(4, 11),
	(4, 12),
--Твердий початківець--
	(5, 13),
	(5, 14),
	(5, 15),
	(6, 16),
	(6, 11),
	(6, 17),
	(7, 18),
	(7, 14),
	(7, 17),
--Компетентний--
	(8, 10),
	(8, 19),
	(8, 20),
	(9, 10),
	(9, 21),
	(9, 22),
	(10, 23),
	(10, 11),
	(10, 17),
--Досвідчений--
	(11, 10),
	(11, 24),
	(11, 25),
	(12, 10),
	(12, 21),
	(12, 26),
	(13, 10),
	(13, 21),
	(13, 27),
--Експерт--
	(14, 10),
	(14, 28),
	(14, 29),
	(15, 10),
	(15, 14),
	(15, 30),
	(16, 31),
	(16, 21),
	(16, 32);
go